Autodesk.Revit.DB.CustomFieldGraphics.GetComputedGraphics
Gets the computed graphics.
Returns:
Returns the computed graphics.

Autodesk.Revit.DB.CustomFieldGraphics.ClearComputedGraphics
Removes all the graphics that were added.

Autodesk.Revit.DB.CustomFieldGraphics.AddComputedGraphics(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject})
Fills in the computed graphics for Revit to display in the schedule cell.
There is no check to see if the computed graphics fit the cell.
The schedule cell width is defined by Autodesk.Revit.DB.CustomFieldOneRowData.CellWidth and schedule cell height by Autodesk.Revit.DB.CustomFieldOneRowData.CellHeight.
The graphics should lie into a plane parallel with XOY.
computedGraphics:
The computed graphics.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.CustomFieldGraphics.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CustomFieldGraphics.Varies
This is the bool which holds if the row items have the same custom graphic representation or not.
If this is true, the computed graphics property will be discarded and, in the cell, will appear a text that indicates that the items have different custom graphic representation.
If it is false, the graphics that were added will be displayed.
The default value stored by this class is false.

Autodesk.Revit.DB.CustomFieldGraphics.#ctor
Constructs a new instance of a CustomFieldGraphics

Autodesk.Revit.DB.CustomFieldGraphics
Class where can be set the computed graphics for one row, and the information if the graphics varies or not for the items grouped on that row.